In [3]:
import pandas as pd

In [10]:


df = pd.DataFrame([['james', 30, 'programmer'],
 ['amy', 20, 'student'],
 ['david', 25, 'designer']],
  columns=['name', 'age', 'job'], 
  index =['a', 'b','c'])

df

    name  age         job
a  james   30  programmer
b    amy   20     student
c  david   25    designer

## 딕셔너리로 만들기

In [12]:


df = pd.DataFrame(
    
{
    'name' : ['james', 'amy', 'david'],
    'age' : [30,20,25],
    'job' : ['programmer', 'student', 'designer']
}   , 
    index = ['a','b','c']
)

df

    name  age         job
a  james   30  programmer
b    amy   20     student
c  david   25    designer

In [13]:
df = pd.read_csv('data/score.csv')
df

       이름     국어   영어   수학
0    kate  100.0   90   95
1  olivia   90.0   80   75
2    emma   95.0  100  100
3  sophia  100.0  100  100
4     amy    NaN   35   60

# 데이터 미리보기

* head(n)
* n을 생략하면 디폴트로 앞의 5개 데이터를 출력

In [15]:
df.head(3)

       이름     국어   영어   수학
0    kate  100.0   90   95
1  olivia   90.0   80   75
2    emma   95.0  100  100

In [16]:
df.tail(3)

       이름     국어   영어   수학
2    emma   95.0  100  100
3  sophia  100.0  100  100
4     amy    NaN   35   60

## 랜덤보기
* sample(n)
* n을 생략하면 1개의 데이터를 출력한다

In [18]:
df.sample()

     이름     국어   영어   수학
0  kate  100.0   90   95

### 랜덤 샘플 비율로 보기

* sample(frac=0.2)
* 지정한 비율의 샘플을 출력

In [19]:
df.sample(frac=0.2)

       이름    국어   영어   수학
1  olivia  90.0   80   75

## 높은 순 /낮은 순 보기

### 높은순보기

In [24]:
df = pd.read_csv('data/scores.csv')

In [25]:
df.nlargest(5,'eng')

      name    kor    eng   math
2   Danial   95.0  100.0  100.0
3     Evan  100.0  100.0  100.0
5      Ian   90.0  100.0   90.0
9    Kevin  100.0  100.0   90.0
14   Chloe   95.0  100.0   95.0

# 데이터 요약보기

## (행, 열)의 크기 보기

In [26]:
df.shape

(30, 4)

## 데이터의 갯수 보기

In [27]:
len(df)

30

In [28]:
df.columns

Index(['name', 'kor', 'eng', 'math'], dtype='object')

In [29]:
df.index

RangeIndex(start=0, stop=30, step=1)

In [30]:
df

        name    kor    eng   math
0      Aiden  100.0   90.0   95.0
1    Charles   90.0   80.0   75.0
2     Danial   95.0  100.0  100.0
3       Evan  100.0  100.0  100.0
4      Henry    NaN   35.0   60.0
5        Ian   90.0  100.0   90.0
6      James   70.0   75.0   65.0
7     Julian   80.0   90.0   55.0
8     Justin   50.0   60.0  100.0
9      Kevin  100.0  100.0   90.0
10       Leo   90.0   95.0   70.0
11    Oliver   70.0   75.0   65.0
12     Peter  100.0   95.0  100.0
13       Amy   90.0   75.0   90.0
14     Chloe   95.0  100.0   95.0
15     Danna  100.0  100.0  100.0
16     Ellen    NaN   60.0    NaN
17      Emma   70.0   65.0   70.0
18  Jennifer   80.0   55.0   80.0
19      Kate   50.0    NaN   50.0
20     Linda  100.0   90.0  100.0
21    Olivia   90.0   70.0   90.0
22      Rose   70.0   65.0   70.0
23     Sofia  100.0  100.0  100.0
24   Tiffany   90.0    NaN   90.0
25   Vanessa   95.0   70.0   95.0
26   Viviana  100.0   80.0  100.0
27    Vikkie    NaN   50.0  100.0
28    Winnie   70.0  100.0   70.0
29      Zuly   80.0   90.0   95.0

## 데이터의 자료형 보기
* 판다스에서는 문자열의 데이터 타입이 object이다

In [31]:
df.dtypes

name     object
kor     float64
eng     float64
math    float64
dtype: object

## 데이터프레임 정보 보기

In [32]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    30 non-null     object
 1   kor     27 non-null     float64
 2   eng     28 non-null     float64
 3   math    29 non-null     float64
dtypes: float64(3), object(1)
memory usage: 1.1+ KB

## 컬럼의 유니크한 데이터 뽑기

In [33]:
df['name'].unique()

array(['Aiden', 'Charles', 'Danial', 'Evan', 'Henry', 'Ian', 'James',
       'Julian', 'Justin', 'Kevin', 'Leo', 'Oliver', 'Peter', 'Amy',
       'Chloe', 'Danna', 'Ellen', 'Emma', 'Jennifer', 'Kate', 'Linda',
       'Olivia', 'Rose', 'Sofia', 'Tiffany', 'Vanessa', 'Viviana',
       'Vikkie', 'Winnie', 'Zuly'], dtype=object)

In [37]:
df['kor'].value_counts()

100.0    8
90.0     6
70.0     5
95.0     3
80.0     3
50.0     2
Name: kor, dtype: int64

In [38]:
df.describe()

              kor         eng        math
count   27.000000   28.000000   29.000000
mean    85.740741   80.892857   84.827586
std     15.045042   18.361270   15.950972
min     50.000000   35.000000   50.000000
25%     75.000000   68.750000   70.000000
50%     90.000000   85.000000   90.000000
75%    100.000000  100.000000  100.000000
max    100.000000  100.000000  100.000000

In [41]:
df['kor'].std()

15.045041586957357

# 시리즈 만들기

* 시리즈 : 엑셀시트의 열1개를 의미한다

In [12]:
s = pd.Series(
['amy', 170,240]
)
s

0    amy
1    170
2    240
dtype: object

In [45]:
s.index

RangeIndex(start=0, stop=3, step=1)

In [47]:
type(s)

pandas.core.series.Series

# 시리즈의 index 와 value 가져오기

In [49]:
s.values

array(['amy', 170, 240], dtype=object)

## 시리즈의 index 지정하기

In [14]:
s.index = ['name','height','footsize']

In [51]:
s

name        amy
height      170
footsize    240
dtype: object

In [52]:
s.index

Index(['name', 'height', 'footsize'], dtype='object')

In [53]:
s.values

array(['amy', 170, 240], dtype=object)

# 시리즈의 통계값 사용하기

In [54]:
s2=pd.Series([10,20,30,40,50])

In [56]:
print('평균:',s2.mean() )
print('최소값:',s2.min() )
print('최대값:',s2.max() )
print('중간값:',s2.median() )
print('표준편차:',s2.std() )

평균: 30.0
최소값: 10
최대값: 50
중간값: 30.0
표준편차: 15.811388300841896

In [57]:
s2.describe()

count     5.000000
mean     30.000000
std      15.811388
min      10.000000
25%      20.000000
50%      30.000000
75%      40.000000
max      50.000000
dtype: float64

# 시리즈의 주요 메서드

In [4]:
s3 = pd.Series([1,3,2,4,10])

In [5]:
s3 = s3.replace(10, 5)
s3

0    1
1    3
2    2
3    4
4    5
dtype: int64

In [6]:
s3.sort_values()

0    1
2    2
1    3
3    4
4    5
dtype: int64

In [8]:
s3.sort_values(ascending=False)

4    5
3    4
1    3
2    2
0    1
dtype: int64

In [9]:
s3.to_frame()

   0
0  1
1  3
2  2
3  4
4  5

In [15]:
s.reset_index()

      index    0
0      name  amy
1    height  170
2  footsize  240